
// Задание 1
// Необходимо написать программу конвертер физических
//  величин.
//  Масса:
//  кг<->грамм<->фунт(lb)<->карат в любую сторону
//  Длина (расстояние):
// метр<->миля<->ярд<->фут в любую сторону
//
// Пользователю сначала предлагается выбрать что
// переводить (масса или расстояние), затем предлагается
// выбрать единицу измерения. Далее пользователь должен ввести
// число. В результате программа должна вывести 4 строки с
// переведенными величинами.
// Пример:
//
// > Выберите что переводить:
// > [1] - масса
// > [2] - расстояние
// > 2
// > Выберите единицу измерения:
// > [1] - метр
// > [2] - миля
// > [3] - ярд
// >  [4] - фут
// > 1
// > Введите число:
// > 10
// > Результат:
// > метры: 10
// > мили: 0.006214
// > ярды: 10.94
// > футы: 32.81

public class Task1 {
    public static void main(String[] args){

    }
}
