
// Задание 13
// Из всех пар элементов, равноудаленных от начала и конца одномерного массива А, найдите пару элементов, имеющих наибольшую сумму. Если элемент не имеет пары. то он не рассматривается.
// Пример
//  A[]={23,12,78,52,76,15,21,82,64,91}.
// Ответ: 78 + 82 = 160.
//
// Если сумм несколько (они одинаковы) должны быть выведены все суммы.
//
// Желательно использовать не более двух циклов(не считая ввода, вывода.)

public class Task13 {
    public static void main(String[] args){

    }
}
