
// Задание 3
// Банк берет комиссию за перевод по принципу - с каждой сотни рублей изымается комиссия - 7 рублей. За неполную сотню также изымается 7 рублей. К примеру, за перевод одного рубля придется выложить 1 + 7 = 8 рублей.
// За перевод 101 рубля придется выложить уже 100 + 7 + 1 + 7 = 115 рублей
//
// Пользователь вводит сумму, которую хочет перевести, а программа должна определить:
// 1. Максимально возможную сумму перевода (с учетом, что комиссия за перевод будет браться из переводимой суммы).
// 2. Комиссию за данный перевод.
//
// Тест 1.
// Сумма к переводу: 10 рублей
// Ответ
// Максимальная сумма: 3 рубля
// Комиссия: 7 рублей

public class Task3 {
    public static void main(String[] args){

    }
}
