
// Задание 9
// Совершенное число - число, которое есть сумма все делителей данного числа, кроме самого числа (например, 6 = 1 + 2 + 3). Пользователь вводит начало диапазона A и его конец Б, а увидеть он желает все совершенные числа, принадлежащие диапазону. Пользователь средней сообразительности, поэтому если в данном диапазоне совершенных чисел нет, об этом не помешает сообщить.
//
// Тест 1.
// А = 6
// Б = 6
// Ответ: 6
//
// Тест 2.
// А = 7
// Б = 13
// Ответ: выводить, увы, нечего!

public class Task9 {
    public static void main(String[] args){

    }
}
