
// Задание 2
// Вам известно время отправления поезда от первой станции, а также время (в минутах), которое ему потребуется, чтобы доехать от очередной станции к следующей. Необходимо вывести на экран расписание прибытия поезда на каждую из станций.
//
// Тест 1.
// Вход:
// Поезд отправляется от первой станции в 7:00
// Станций: 4
// Время движения до второй станции 10 минут
// Время движения до третьей станции 5 минут
// Время движения до четвертой станции 3 минуты
//
// Выход:
// 07:00
// 07:10
// 07:15
// 07:18
//
// Тест 2.
// Вход:
// Поезд отправляется от первой станции в 22:58
// Станций: 5
// Время движения до второй станции 2 минуты
// Время движения до третьей станции 60 минут
// Время движения до четвертой станции 43 минуты
// Время движения до пятой станции 20 минут
//
// Выход:
// 22:58
// 23:00
// 00:00
// 00:43
// 01:03

public class Task2 {
    public static void main(String[] args){

    }
}
