
// Задание 4
// Имеются два целых неотрицательных числа.
// Лучшим является то, у которого сумма всех цифр больше. Например, число 495 лучше числа 980, так как 4 + 9 + 5 > 9 + 8 + 0.
// Если же сумма цифр одинаковая, то лучшим будет то число, у которого этих самых цифр меньше. К примеру, число 13, лучше числа 211, хотя 1 + 3 == 2 + 1 + 1.
//
// Как узнать, какое из чисел лучше?
//
// Тест 1. Второе число лучше
// Первое число: 3
// Второе число: 4
// Ответ: 4

public class Task4 {
    public static void main(String[] args){

    }
}
