
// Задание 6
// Дано определенное количество различных состояний цифровых часов в формате чч::мм::cc
// Необходимо вывести их на экран таким образом, чтобы каждое новое состояние было больше (позже), чем предыдущее.
//
// Тест
// Входные данные
// Кол-во интервалов: 4
// 1) 10 : 20 : 30
// 2) 7 : 30 : 00
// 3) 23 : 59 : 59
// 4) 13 : 30 : 30
//
// Выходные данные
// 7 : 30 : 00
// 10 : 20 : 30
// 13 : 30 : 30
// 23 : 59 : 59

public class Task6 {
    public static void main(String[] args){

    }
}
