
// Задание 11
// Выигрышным считается билет, у которого сумма цифр первой половины числа равна сумме цифр второй половины числа. Определите, является ли данный билет выигрышным.
//
// Входные данные
// Целое число от 0 до 10^8
//
// Выходные данные
// 0 - если билет не выигрышный.
// 1 - если билет выигрышный.
//
// Тест 1.
// Число 123114 -> 1 + 2 +3 = 1 + 1 + 4
// Ответ: 1
//
// Тест 2.
// Число 12345 -> число имеет нечетное кол-во цифр
// Ответ 0.

public class Task11 {
    public static void main(String[] args){

    }
}
