public class Hello {
    public static void main(String[] args) {
        // Задание 1. Вывести на консоль следующий набор символов:
        //а=1,  c=a+1   m=2,    n=3     решение уравнений
        //b=6,  d=b*2-1     p=4,    g=5     нахождение корней
        System.out.println("a=1,\tc=a+1\tm=2,\tn=3\tрешение уравнений\n" +
                "b=6,\td=b*2-1\tp=4,\tg=5\tнахождение корней");

        // Задание 2. Вывести на консоль следующий набор символов:
        //      1
        //    1 2 3
        //  1 2 3 4 5
        //1 2 3 4 5 6 7
        System.out.println("" +
                "   1\n" +
                "  123\n" +
                " 12345\n" +
                "1234567"
        );
    }
}
