package lab5;

public class Lab5 {
    public static void execute(){

    }
}


// ПРАКТИЧЕСКОЕ ЗАДАНИЕ
//    1. разработать Generic-класс, позволяющий работать с группами объектов по варианту (добавлять, удалять и т.д.);
//    2. разработать метод Generic-класса позволяющий добавить в структуру коллекцию объектов.
//    Протестируйте метод на коллекциях разных видов и посмотрите за ошибками компиляции, которые возникают при неправильном использовании generics;
//    3. разработать статический generic-метод, который работает с разработанным Generic-классом.
//    Действие, которое должен выполнять метод, задается индивидуальным вариантом.

// Вариант 3
// Структура данных generic-класса односвязный список.
// Generic-метод возвращает группу, в которой содержатся четные элементы из входной группы.